In [1]:
import pandas as pd

In [8]:
df = pd.read_excel('tt.xlsx', header=None)
df.head()

,0,1,2,3,4,5,6,7,8
0,期別,2018.3Q,2018.2Q,2018.1Q,2017.4Q,2017.3Q,2017.2Q,2017.1Q,2016.4Q
1,種類,合併,合併,合併,合併,合併,合併,合併,合併
2,營業收入毛額,5314,4253,3851,4876,6127,3744,3680,4872
3,營業收入淨額,5314,4253,3851,4876,6127,3744,3680,4872
4,銷貨成本,3587,3259,3011,3523,4384,3081,2958,3680

In [21]:
ser = df.iloc[:, 1]
df5 = pd.DataFrame(ser).T
df5.columns = range(1, len(ser)+1)
df5

,1,2,3,4,5,6,7,8,9,10,...,98,99,100,101,102,103,104,105,106,107
1,2018.3Q,合併,5314,5314,3587,3587,1728,0,1728,462,...,0,4.17,650,0,945,0,0,0,1323,1944

In [22]:
df5[7] / df5[3]

1    0.325179
dtype: object